//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**        5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093         **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************

//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:        SecureBootMod.UNI
//
// Description:    String definitions for Security Module
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>

/=#
#include "VFR.uni"

#string STR_EMPTY_STRING                #language eng ""

#string STR_SECURE_BOOT_ENABLE          #language eng  "Secure Boot"
#string STR_SECURE_BOOT_HELP            #language eng  "Secure Boot can be enabled if 1.System running in User mode with enrolled Platform Key(PK) 2.CSM function is disabled"

#string SECURE_BOOT_MENU_FORM_TITLE     #language eng  "Secure Boot menu"
#string SECURE_BOOT_MENU_FORM_HELP      #language eng  "Customizable Secure Boot settings"

#string STR_SECURE_BOOT_MODE            #language eng  "Secure Boot Mode"
#string SECURE_BOOT_STANDARD            #language eng  "Standard"
#string SECURE_BOOT_CUSTOM              #language eng  "Custom"
#string STR_SECURE_BOOT_MODE_HELP       #language eng  "Secure Boot mode selector. 'Custom' Mode enables users to change Image Execution policy and manage Secure Boot Keys."
#string IMAGE_EXEC_POLICY_FORM_TITLE    #language eng  "Image Execution Policy"
#string IMAGE_EXEC_POLICY_FORM_HELP     #language eng  "Manage Image Execution Policy on Security Violation"

#string STR_LOAD_FROM_HELP              #language eng "Image Execution Policy per device path on Security Violation."
#string STR_LOAD_FROM_FV                #language eng "Internal FV"
#string STR_LOAD_FROM_OROM              #language eng "Option ROM"
#string STR_LOAD_FROM_REMOVABLE_MEDIA   #language eng "Removable Media"
#string STR_LOAD_FROM_FIXED_MEDIA       #language eng "Fixed Media"

#string ALWAYS_ENABLED                  #language eng  "Always Execute"
#string ALWAYS_DISABLED                 #language eng  "Always Deny"
#string ALLOW_EXECUTE_ON_SECURITY_VIOLATION    #language eng  "Allow Execute"
#string DEFER_EXECUTE_ON_SECURITY_VIOLATION    #language eng  "Defer Execute"
#string DENY_EXECUTE_ON_SECURITY_VIOLATION     #language eng  "Deny Execute"
#string QUERY_USER_ON_SECURITY_VIOLATION       #language eng  "Query User"

#string STR_SECPLATFORM_FORM            #language eng "Change default System Mode"
#string STR_RESET_INFO                  #language eng "Reset is required for changes to take effect."
#string STR_SECPLATFORM_FORM_HELP       #language eng "Update System Secure Boot settings"

#string STR_PLATFORM_MODE               #language eng "System Mode"
#string STR_SETUP                       #language eng "Setup"
#string STR_USER                        #language eng "User"
#string STR_PLATFORM_SECURE_MODE        #language eng "Secure Boot"
#string STR_ACTIVE                      #language eng "Active"
#string STR_INACTIVE                    #language eng "Not Active"

#string STR_DEFAULT_KEY_PROVISION_MODE   #language eng "Default Key Provision"
#string STR_KEY_PROVISION_MODE_HELP      #language eng "Install Factory default Secure Boot Keys when System is in Setup Mode."

#string STR_KEY_MANAGEMENT_TITLE        #language eng "Key Management"
#string STR_KEY_MANAGEMENT_HELP         #language eng "Enables experienced users to modify Secure Boot variables"

#string STR_FORCE_SETUP_MODE            #language eng "Delete All Secure Boot Variables"
#string STR_GET_ALL_VARS                #language eng "Save   All Secure Boot Variables"
#string STR_FORCE_SETUP_MODE_HELP       #language eng "Force System to Setup Mode - clear all Secure Boot Variables(PK,KEK,db,dbx and dbt). Change takes effect after reboot."
#string STR_FORCE_DEFAULT_MODE_HELP     #language eng "Force System to User Mode - install all Factory Default keys(PK,KEK,db,dbx,dbt). Change takes effect after reboot."
#string STR_FORCE_DEFAULT_MODE          #language eng "Enroll All Factory Default Keys"

#string STR_INSTALLED                   #language eng "INSTALLED"
#string STR_NOT_INSTALLED               #language eng "NOT INSTALLED"

#string STR_FILE_SYSTEM                 #language eng "Select File from a File system"
#string STR_FILE_SELECT                 #language eng "Select File"

#string STR_MANAGE_PK                   #language eng "Platform Key (PK)"
#string STR_SET_PK                      #language eng "Set new PK"
#string STR_SET_PK_DEFAULT_HELP         #language eng "Restores default PK variable"
#string STR_GET_PK_HELP                 #language eng "Store content of each Secure Boot Variable(data formatted as EFI_SIGNATURE_LIST) to a file with matching name on selected file system's root folder."
#string STR_DELETE_PK                   #language eng "Delete  PK"
#string STR_DELETE_PK_HELP              #language eng "Delete the Variable from NVRAM. Removing PK will reset System to Setup Mode"

#string STR_MANAGE_KEK                  #language eng "Key Exchange Key (KEK)"
#string STR_SET_KEK                     #language eng "Set new KEK"
#string STR_DELETE_KEK                  #language eng "Delete  KEK"
#string STR_APPEND_KEK_ENTRY            #language eng "Append  KEK"
#string STR_APPEND_KEK_ENTRY_HELP       #language eng "Insert Factory Default Keys or load from a file formatted as:\n1.Public Key Certificate in:\n a)EFI_SIGNATURE_LIST,\n b)EFI_CERT_X509 (DER encoded),\n c)EFI_CERT_RSA2048 (bin),\n d)EFI_CERT_SHA256 (bin)\n2.Efi Time-Based Authenticated Variable" 

#string STR_MANAGE_DB                   #language eng "Authorized Signatures"
#string STR_SET_DB                      #language eng "Set new DB"
#string STR_DELETE_DB                   #language eng "Delete  DB"
#string STR_APPEND_DB_ENTRY             #language eng "Append  DB"

#string STR_MANAGE_DBT                  #language eng "Authorized TimeStamps"
#string STR_SET_DBT                     #language eng "Set new DBT"
#string STR_DELETE_DBT                  #language eng "Delete  DBT"
#string STR_APPEND_DBT_ENTRY            #language eng "Append  DBT"

#string STR_MANAGE_DBX                  #language eng "Forbidden Signatures"
#string STR_SET_DBX                     #language eng "Set new DBX"
#string STR_DELETE_DBX                  #language eng "Delete  DBX"
#string STR_APPEND_DBX_ENTRY            #language eng "Append  DBX"

#string STR_SECURE_SET                  #language eng "Set New Key"
#string STR_SECURE_APPEND               #language eng "Append Key"

#string STR_SECURE_TITLE                #language eng "Input File Format"
#string STR_SECURE_VAR                  #language eng "Authenticated Variable"
#string STR_SECURE_CER                  #language eng "Public Key Certificate"

#string STR_ENABLE_ERROR_MODE_TITLE  #language eng "Platform in Setup Mode!"
#string STR_ENABLE_ERROR_MODE        #language eng "Secure Boot can be enabled when Platform is in User Mode. Repeat operation after enrolling Platform Key(PK)"
#string STR_CSM_LOAD_TITLE           #language eng "WARNING: CSM is Loaded!"
#string STR_CSM_LOAD                 #language eng "Disable the CSM in Setup. Repeat operation after Reboot to ensure UEFI Video (GOP) driver is operational."
#string STR_RESET_TO_SETUP           #language eng "Deleting all variables will reset Platform to Setup Mode. Do you wish to proceed?"
#string STR_LOAD_DEFAULT_VARS_TITLE  #language eng "Install factory defaults"
#string STR_LOAD_DEFAULT_VARS        #language eng "Press 'Yes' to install factory default keys"
#string STR_VAR_UPDATE_LOCKED_TITLE  #language eng "Secure Variable Update is locked down!"
#string STR_VAR_UPDATE_LOCKED        #language eng "Try again after System reboot"
#string STR_UPDATE_FROM_DEFAULTS     #language eng "Press 'Yes' to load factory default '%s'\n or Select 'No' to load it from a\n file on external media."
#string STR_UPDATE_FROM_FILE         #language eng "Confirm update of '%s' with content from the file '%s'?"
#string STR_FAILED                   #language eng "Failed!"
#string STR_SUCCESS                  #language eng "Success!"
#string STR_WRITE_ERROR_TITLE        #language eng "Error While Writing to File"
#string STR_SAVE_SEC_KEY_TITLE       #language eng "Save Security Key/Database"
#string STR_SAVE_SEC_KEY             #language eng "%d variable(s) saved to disk!"
#string STR_DELETE_SEC_KEY_TITLE     #language eng "Delete Security Key/Database"
#string STR_DELETE_SEC_KEY           #language eng "Confirm deletion of '%s' from NVRAM?"
#string STR_NO_VALID_FS_TITLE        #language eng "No Valid File System"
#string STR_NO_VALID_FS              #language eng "No Valid File System Available"
#string STR_NO_VALID_FILE_TITLE      #language eng "No Valid File"
#string STR_NO_VALID_FILE            #language eng "No Valid File Available in the Selected File System"

//**********************************************************************
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**        5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093         **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
